SectionnerServer/Sectionner.SetServerOptions.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns="Sectionner">
 <SOAP-ENV:Body>
  <!-- ns__SetServerOptions(..., ns__User requestUser, ns__ServerOptions serverOptions, ...) -->
  <ns:SetServerOptions>
   <!-- ns__User requestUser -->
   <requestUser>
    <!-- int uId -->
    <uId>0</uId>
    <!-- std::string uName -->
    <uName></uName>
    <!-- std::string uPassword -->
    <uPassword></uPassword>
    <!-- std::string uRePassword -->
    <uRePassword></uRePassword>
    <!-- std::string uFirstName -->
    <uFirstName></uFirstName>
    <!-- std::string uLastName -->
    <uLastName></uLastName>
    <!-- enum ns__UserType uType -->
    <uType>Monitor</uType>
    <!-- std::string uKey -->
    <uKey></uKey>
    <!-- ns__ErrorCode uErr -->
    <uErr>
     <!-- int eNo -->
     <eNo>0</eNo>
     <!-- std::string eMsg -->
     <eMsg></eMsg>
     <!-- enum ns__SettingLevel eType -->
     <eType>Normal</eType>
    </uErr>
   </requestUser>
   <!-- ns__ServerOptions serverOptions -->
   <serverOptions>
    <!-- ns__DataBase soDataBase -->
    <soDataBase>
     <!-- std::string dbServer -->
     <dbServer></dbServer>
     <!-- int bdPort -->
     <bdPort>0</bdPort>
     <!-- std::string dbUser -->
     <dbUser></dbUser>
     <!-- std::string dbPassWord -->
     <dbPassWord></dbPassWord>
     <!-- ns__ErrorCode dbErr -->
     <dbErr>
      <!-- int eNo -->
      <eNo>0</eNo>
      <!-- std::string eMsg -->
      <eMsg></eMsg>
      <!-- enum ns__SettingLevel eType -->
      <eType>Normal</eType>
     </dbErr>
    </soDataBase>
    <!-- int soRepeat -->
    <soRepeat>0</soRepeat>
    <!-- ns__ErrorCode soErr -->
    <soErr>
     <!-- int eNo -->
     <eNo>0</eNo>
     <!-- std::string eMsg -->
     <eMsg></eMsg>
     <!-- enum ns__SettingLevel eType -->
     <eType>Normal</eType>
    </soErr>
   </serverOptions>
  </ns:SetServerOptions>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
